app/controllers/patient_records_controller.rb

  def headers
    record = PatientRecord.find(params[:id])
---
SELECT "patient_records".* FROM "patient_records" WHERE "patient_records"."id" = 'b2109def-8480-428b-951b-64e334bbef7f' LIMIT 1